"use strict";

// ! ======================================= ОПЕРАТОРИ=======================================

/*Використовуючи все, що ви дізналися до цього моменту, напишіть скрипт, який запитує користувача про ширину, висоту і довжину коробки, а потім обчислює і повертає користувачеві об'єм цієї коробки.

Наприклад, коробка з шириною = 20, висотою = 10 і довжиною = 50 матиме об'єм 10000 (опускаючи одиниці виміру, оскільки вони не мають значення в цьому сценарії). Наразі припустимо, що значення, надані користувачем, є дійсними числами, але якщо у вас є якісь ідеї, ви можете спробувати зробити цей скрипт таким чином, щоб він був стійким до недійсних значень.*/

// let width = +prompt("Enter a number", 0);
// let height = +prompt("Enter a number", 0);
// let length = +prompt("Enter a number", 0);

// let result = width * height * length;
// console.log(`Об'єм коробки становить ${result} см куб`);

// ! =================================== ЛАБОРАТОРНА РОБОТА ===================================

/*Сценарій
Повернімося до нашого списку контактів. Після деяких нещодавніх змін (наприклад, використання масиву та об'єктів) він дійсно починає виглядати як список. Однак залишилася одна досить серйозна проблема. Зміна даних у списку, наприклад, додавання нового контакту, має бути передбачена безпосередньо в програмному коді. А якщо ми хочемо дати користувачеві можливість вводити дані доданого контакту під час роботи програми? Модифікуйте програму так, щоб в кінці списку додавався не той контакт, який вказано в коді, а той, який введе користувач під час запуску програми. Для цього використовуйте метод підказки. В кінці виведіть на екран перший і останній контакт зі списку. */

const newContacts = [
    {
        name: "Maxwell Wright",
        phone: "(0191) 719 6495",
        email: "Curabitur.egestas.nunc@nonummuyac.co.uk",
    },

    {
        name: "Rija Vilarreal",
        phone: "0866 398 2895",
        email: "posuere.vulputate@sed.com",
    },

    {
        name: "Helen Richards",
        phone: "0800 1111",
        email: "libero@convallis.com",
    },
];

// let contactName = prompt(`Enter a name`, "Sofi Happy");
// let contactPhone = prompt(`Enter a phone`, "095123888");
// let contactEmail = prompt(`Enter an email`, "example@poshta.com");

// newContacts.push({
//     name: contactName,
//     phone: contactPhone,
//     email: contactEmail,
// });

// console.table(newContacts);
